issue-reporter-api/app/controllers/auth_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "teacher"], ["LIMIT", 1]]
---
  def create
# byebug
    user = User.find_by(username: params[:username])