issue-reporter-api/app/controllers/repos_controller.rb

SELECT "repos".* FROM "repos" WHERE "repos"."cohort_name" = $1  [["cohort_name", "dumbo-web-051319"]]
---
  def index
    # repos = Repo.all
    repos = Repo.where(cohort_name: 'dumbo-web-051319')

SELECT  "repos".* FROM "repos" WHERE "repos"."id" = $1 LIMIT $2  [["id", 173502], ["LIMIT", 1]]
---
  def show
    repo = Repo.find(params[:id])