issue-reporter-api/app/controllers/surveys_controller.rb

  def index
    surveys = Survey.all
---
SELECT "surveys".* FROM "surveys"