issue-reporter-api/app/controllers/users_controller.rb

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "karma" = $1 WHERE "users"."id" = $2  [["karma", 11], ["id", 514]]