app/controllers/repos_controller.rb

  def subset
    subset = Repo.where(cohort_name: 'dumbo-web-051319').take(10)
---
SELECT "repos".* FROM "repos" WHERE "repos"."cohort_name" = $1  [["cohort_name", "dumbo-web-051319"]]